In [1]:
import pandas as pd 
import numpy as np

In [2]:
df=pd.DataFrame([['google','it company','Mumbai'],
                 ['amazon','ecommerce','Gurgaon'],
                 ['Tata son','industry','Jamshedpur']]
               )
df.columns=['company name','company type','Address']
df

  company name company type     Address
0       google   it company      Mumbai
1       amazon    ecommerce     Gurgaon
2     Tata son     industry  Jamshedpur

In [5]:
df.groupby('company name')

In [9]:
df.groupby(['company name']).median()

C:\Users\Md Rashid\AppData\Local\Temp\ipykernel_1232\3424592225.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.median is deprecated. In a future version, a TypeError will be raised. Before calling .median, select only columns which should be valid for the function.
  df.groupby(['company name']).median()

Empty DataFrame
Columns: []
Index: [Tata son, amazon, google]